In [1]:
import pandas as pd

In [3]:
train = pd.read_csv("TRAIN.csv")

In [4]:
train.head()

,ID,Store_id,Store_Type,Location_Type,Region_Code,Date,Holiday,Discount,#Order,Sales
0,T1000001,1,S1,L3,R1,2018-01-01,1,Yes,9,7011.84
1,T1000002,253,S4,L2,R1,2018-01-01,1,Yes,60,51789.12
2,T1000003,252,S3,L2,R1,2018-01-01,1,Yes,42,36868.20
3,T1000004,251,S2,L3,R1,2018-01-01,1,Yes,23,19715.16
4,T1000005,250,S2,L3,R4,2018-01-01,1,Yes,62,45614.52

In [5]:
train["Date"] = pd.to_datetime(train["Date"])

In [6]:
print(train["Date"].min())
print(train["Date"].max())

2018-01-01 00:00:00
2019-05-31 00:00:00

In [7]:
train.describe()

            Store_id        Holiday         #Order          Sales
count  188340.000000  188340.000000  188340.000000  188340.000000
mean      183.000000       0.131783      68.205692   42784.327982
std       105.366308       0.338256      30.467415   18456.708302
min         1.000000       0.000000       0.000000       0.000000
25%        92.000000       0.000000      48.000000   30426.000000
50%       183.000000       0.000000      63.000000   39678.000000
75%       274.000000       0.000000      82.000000   51909.000000
max       365.000000       1.000000     371.000000  247215.000000

In [8]:
train[['Store_id','Date','Sales']].groupby(['Store_id','Date']).count()

                     Sales
Store_id Date
1        2018-01-01      1
         2018-01-02      1
         2018-01-03      1
         2018-01-04      1
         2018-01-05      1
...                    ...
365      2019-05-27      1
         2019-05-28      1
         2019-05-29      1
         2019-05-30      1
         2019-05-31      1

[188340 rows x 1 columns]